teaching/pds1/slides/01-introducao.org



#+title: Linguagem C - Introdução



#+author: Luigi D. C. Soares
#+email: <luigi.domenico@dcc.ufmg.br>

#+subtitle: Progamação e Desenvolvimento de Software I

#+date: DCC/UFMG (25/08/2022)

#+startup: beamer latexpreview
#+options: H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+options: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+latex_class: beamer
#+latex_class_options: [t, aspectratio=169]
#+latex_header: \usepackage{tikz}
#+beamer_header: \title[Linguagem C]{Linguagem C - Introdução}
#+beamer_header: \subtitle{Programação e Desenvolvimento de Software I}
#+beamer_header: \author[\tiny\{gleison.mendonca, luigi.domenico\}@dcc.ufmg.br]{%
#+beamer_header: Gleison S. D. Mendonça, Luigi D. C. Soares\texorpdfstring{\\}{}
#+beamer_header: \texttt{\{gleison.mendonca, luigi.domenico\}@dcc.ufmg.br}}
#+beamer_header: \institute[DCC/UFMG]{}
#+beamer_header: \date[25/08/2022]{}
#+beamer_header: %\usetheme{saori}
#+beamer_header: %\usemintedstyle{native}
#+beamer_header: \usetheme{ufmg}

* Linguagem C

- Criada em 1972

- Linguagem imperativa
  - Uso de comandos: Se *x* _Faça!_ *y*
  - Comandos alteram o estado do programa

* Linguagem C

- Criada em 1972

- Linguagem imperativa
  - Uso de comandos: Se *x* _Faça!_ *y*
  - Comandos alteram o estado do programa

- Linguagem procedural
  - Decomposição de um problema em diferentes funções e módulos
  - Reutilização de código

* Linguagem C

- Criada em 1972

- Linguagem imperativa
  - Uso de comandos: Se *x* _Faça!_ *y*
  - Comandos alteram o estado do programa

- Linguagem procedural
  - Decomposição de um problema em diferentes funções e módulos
  - Reutilização de código

- Acesso de baixo nível á memória
- Utilização de instruções Assembly (código de máquina)
- Gera códigos geralmente mais velozes

* Linguagem C

- Criada em 1972

- Linguagem imperativa
  - Uso de comandos: Se *x* _Faça!_ *y*
  - Comandos alteram o estado do programa

- Linguagem procedural
  - Decomposição de um problema em diferentes funções e módulos
  - Reutilização de código

- Acesso de baixo nível á memória
- Utilização de instruções Assembly (código de máquina)
- Gera códigos geralmente mais velozes

- Sair de C para outras linguagens é mais fácil que o sentido oposto

* Primeiro programa em C

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output
#include <stdio.h> // Inclusão do módulo de entrada/saída

// Ponto de entrada do programa
int main(int argc, char *argv[]) {
    // TODO
    return 0;
}
#+end_src

* Primeiro programa em C

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output
#include <stdio.h> // Inclusão do módulo de entrada/saída

// Ponto de entrada do programa
int main(int argc, char *argv[]) {
    // Escreve uma mensagem na tela de saída
    printf("Olá mundo\n");
    return 0;
}
#+end_src

#+RESULTS:
: Olá mundo

* Indentação

- Espaçamento colocado antes de começar a escrever o código na linha

* Indentação

- Espaçamento colocado antes de começar a escrever o código na linha
- É importante!

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output
#include <stdio.h>
int main(int argc, char *argv[]) { printf("Olá mundo\n"); return 0; }
#+end_src

#+RESULTS:
: Olá mundo

* Primeiro problema

Suponha que soma (+) e subtração (-) são as únicas operações disponíveis.

Dados dois números inteiros positivos *A* e *B*, determine o *quociente* e o *resto*
da divisão de *A* por *B.*

* Primeiro problema

*Ideia de solução*:
- Representar os números *A* e *B* por retângulos de *larguras* proporcionais aos seus valores
- Verificar quantas vezes *B* cabe em *A*
#+latex: \vspace{0.5em}\centering\tikzset{every picture/.style={line width=0.75pt}} %set default line width to 0.75pt
\begin{tikzpicture}[x=0.75pt,y=0.75pt,yscale=-1,xscale=1]
%uncomment if require: \path (0,126); %set diagram left start at 0, and has height of 126

%Shape: Rectangle [id:dp7852098459874652]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (41,21) -- (111,21) -- (111,51.03) -- (41,51.03) -- cycle ;
%Shape: Rectangle [id:dp35920484998714075]
\draw  [fill={rgb, 255:red, 178; green, 53; blue, 37 }  ,fill opacity=1 ] (41,61) -- (70.01,61) -- (70.01,92.03) -- (41,92.03) -- cycle ;
%Shape: Rectangle [id:dp31032605623178733]
\draw  [fill={rgb, 255:red, 178; green, 53; blue, 37 }  ,fill opacity=1 ] (180.67,19.67) -- (210.68,19.67) -- (210.68,50.7) -- (180.67,50.7) -- cycle ;
%Shape: Rectangle [id:dp9954521977784945]
\draw  [fill={rgb, 255:red, 178; green, 53; blue, 37 }  ,fill opacity=1 ] (210.68,19.67) -- (239.69,19.67) -- (239.69,50.7) -- (210.68,50.7) -- cycle ;
%Shape: Rectangle [id:dp0077618542939301705]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (239.69,19.67) -- (249.67,19.67) -- (249.67,50.7) -- (239.69,50.7) -- cycle ;

% Text Node
\draw (67,27) node [anchor=north west][inner sep=0.75pt]  [font=\Large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {A};
% Text Node
\draw (47,68) node [anchor=north west][inner sep=0.75pt]  [font=\Large,color={rgb, 255:red, 255; green, 255; blue, 255 }  ,opacity=1 ] [align=left] {B};
\end{tikzpicture}

- *A = 7*
- *B = 3*

* Algoritmo

- Para resolver um problema, primeiro precisamos de uma descrição clara da solução
- Um algoritmo é uma sequência de instruções (receita)
  - Finita
  - Não pode ser ambígua

* Algoritmo

- Para resolver um problema, primeiro precisamos de uma descrição clara da solução
- Um algoritmo é uma sequência de instruções (receita)
  - Finita
  - Não pode ser ambígua

*Voltando ao nosso problema:*

* Algoritmo

- Para resolver um problema, primeiro precisamos de uma descrição clara da solução
- Um algoritmo é uma sequência de instruções (receita)
  - Finita
  - Não pode ser ambígua

*Voltando ao nosso problema:*

- Sejam A e B os valores dados
- Atribuir o valor 0 ao quociente (q)

* Algoritmo

- Para resolver um problema, primeiro precisamos de uma descrição clara da solução
- Um algoritmo é uma sequência de instruções (receita)
  - Finita
  - Não pode ser ambígua

*Voltando ao nosso problema:*

- Sejam A e B os valores dados
- Atribuir o valor 0 ao quociente (q)
- Enquanto *B <= A*:

* Algoritmo

- Para resolver um problema, primeiro precisamos de uma descrição clara da solução
- Um algoritmo é uma sequência de instruções (receita)
  - Finita
  - Não pode ser ambígua

*Voltando ao nosso problema:*

- Sejam A e B os valores dados
- Atribuir o valor 0 ao quociente (q)
- Enquanto *B <= A*:
  - Somar 1 ao valor de q
  - Subtrair B do valor de A

