teaching/pds1/slides/01-introducao.tex
% Created 2022-08-19 sex 20:45
% Intended LaTeX compiler: pdflatex
\documentclass[t, aspectratio=169]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[newfloat]{minted}
\usepackage{tikz}
\usetheme{default}
\author{Luigi D. C. Soares}
\date{DCC/UFMG (25/08/2022)}
\title{Linguagem C - Introdução}
\subtitle{Progamação e Desenvolvimento de Software I}
\title[Linguagem C]{Linguagem C - Introdução}
\subtitle{Programação e Desenvolvimento de Software I}
\author[\tiny\{gleison.mendonca, luigi.domenico\}@dcc.ufmg.br]{%
Gleison S. D. Mendonça, Luigi D. C. Soares\texorpdfstring{\\}{}
\texttt{\{gleison.mendonca, luigi.domenico\}@dcc.ufmg.br}}
\institute[DCC/UFMG]{}
\date[25/08/2022]{}
%\usetheme{saori}
%\usemintedstyle{native}
\usetheme{ufmg}
\hypersetup{
 pdfauthor={Luigi D. C. Soares},
 pdftitle={Linguagem C - Introdução},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle

\begin{frame}[label={sec:orgaa5a543}]{Linguagem C}
\begin{itemize}
\item Criada em 1972

\item Linguagem imperativa
\begin{itemize}
\item Uso de comandos: Se \alert{x} \uline{Faça!} \alert{y}
\item Comandos alteram o estado do programa
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orga43e3dd}]{Linguagem C}
\begin{itemize}
\item Criada em 1972

\item Linguagem imperativa
\begin{itemize}
\item Uso de comandos: Se \alert{x} \uline{Faça!} \alert{y}
\item Comandos alteram o estado do programa
\end{itemize}

\item Linguagem procedural
\begin{itemize}
\item Decomposição de um problema em diferentes funções e módulos
\item Reutilização de código
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgdc781ea}]{Linguagem C}
\begin{itemize}
\item Criada em 1972

\item Linguagem imperativa
\begin{itemize}
\item Uso de comandos: Se \alert{x} \uline{Faça!} \alert{y}
\item Comandos alteram o estado do programa
\end{itemize}

\item Linguagem procedural
\begin{itemize}
\item Decomposição de um problema em diferentes funções e módulos
\item Reutilização de código
\end{itemize}

\item Acesso de baixo nível á memória
\item Utilização de instruções Assembly (código de máquina)
\item Gera códigos geralmente mais velozes
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org45d876b}]{Linguagem C}
\begin{itemize}
\item Criada em 1972

\item Linguagem imperativa
\begin{itemize}
\item Uso de comandos: Se \alert{x} \uline{Faça!} \alert{y}
\item Comandos alteram o estado do programa
\end{itemize}

\item Linguagem procedural
\begin{itemize}
\item Decomposição de um problema em diferentes funções e módulos
\item Reutilização de código
\end{itemize}

\item Acesso de baixo nível á memória
\item Utilização de instruções Assembly (código de máquina)
\item Gera códigos geralmente mais velozes

\item Sair de C para outras linguagens é mais fácil que o sentido oposto
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org98c95d3},fragile]{Primeiro programa em C}
 \begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h> // Inclusão do módulo de entrada/saída

// Ponto de entrada do programa
int main(int argc, char *argv[]) {
    // TODO
    return 0;
}
\end{minted}
\end{frame}

\begin{frame}[label={sec:orgd682682},fragile]{Primeiro programa em C}
 \begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h> // Inclusão do módulo de entrada/saída

// Ponto de entrada do programa
int main(int argc, char *argv[]) {
    // Escreve uma mensagem na tela de saída
    printf("Olá mundo\n");
    return 0;
}
\end{minted}
\end{frame}

\begin{frame}[label={sec:org15314b4}]{Indentação}
\begin{itemize}
\item Espaçamento colocado antes de começar a escrever o código na linha
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org7fcd2c5},fragile]{Indentação}
 \begin{itemize}
\item Espaçamento colocado antes de começar a escrever o código na linha
\item É importante!
\end{itemize}

\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) { printf("Olá mundo\n"); return 0; }
\end{minted}
\end{frame}

\begin{frame}[label={sec:org0596c25}]{Primeiro problema}
Suponha que soma (+) e subtração (-) são as únicas operações disponíveis.

Dados dois números inteiros positivos \alert{A} e \alert{B}, determine o \alert{quociente} e o \alert{resto}
da divisão de \alert{A} por \alert{B.}
\end{frame}

\begin{frame}[label={sec:org81a067a}]{Primeiro problema}
\alert{Ideia de solução}:
\begin{itemize}
\item Representar os números \alert{A} e \alert{B} por retângulos de \alert{larguras} proporcionais aos seus valores
\item Verificar quantas vezes \alert{B} cabe em \alert{A}
\end{itemize}
\vspace{0.5em}\centering\tikzset{every picture/.style={line width=0.75pt}} %set default line width to 0.75pt
\begin{tikzpicture}[x=0.75pt,y=0.75pt,yscale=-1,xscale=1]
%uncomment if require: \path (0,126); %set diagram left start at 0, and has height of 126

%Shape: Rectangle [id:dp7852098459874652]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (41,21) -- (111,21) -- (111,51.03) -- (41,51.03) -- cycle ;
%Shape: Rectangle [id:dp35920484998714075]
\draw  [fill={rgb, 255:red, 178; green, 53; blue, 37 }  ,fill opacity=1 ] (41,61) -- (70.01,61) -- (70.01,92.03) -- (41,92.03) -- cycle ;
%Shape: Rectangle [id:dp31032605623178733]
\draw  [fill={rgb, 255:red, 178; green, 53; blue, 37 }  ,fill opacity=1 ] (180.67,19.67) -- (210.68,19.67) -- (210.68,50.7) -- (180.67,50.7) -- cycle ;
%Shape: Rectangle [id:dp9954521977784945]
\draw  [fill={rgb, 255:red, 178; green, 53; blue, 37 }  ,fill opacity=1 ] (210.68,19.67) -- (239.69,19.67) -- (239.69,50.7) -- (210.68,50.7) -- cycle ;
%Shape: Rectangle [id:dp0077618542939301705]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (239.69,19.67) -- (249.67,19.67) -- (249.67,50.7) -- (239.69,50.7) -- cycle ;

% Text Node
\draw (67,27) node [anchor=north west][inner sep=0.75pt]  [font=\Large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {A};
% Text Node
\draw (47,68) node [anchor=north west][inner sep=0.75pt]  [font=\Large,color={rgb, 255:red, 255; green, 255; blue, 255 }  ,opacity=1 ] [align=left] {B};
\end{tikzpicture}

\begin{itemize}
\item \alert{A = 7}
\item \alert{B = 3}
\end{itemize}
\end{frame}
