teaching/pds1/slides/01-introducao.tex

\begin{frame}[label={sec:org1c8b795}]{Algoritmo}
\begin{itemize}
\item Para resolver um problema, primeiro precisamos de uma descrição clara da solução
\item Um algoritmo é uma sequência de instruções (receita)
\begin{itemize}
\item Finita
\item Não pode ser ambígua
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org12a7212}]{Algoritmo}
\begin{itemize}
\item Para resolver um problema, primeiro precisamos de uma descrição clara da solução
\item Um algoritmo é uma sequência de instruções (receita)
\begin{itemize}
\item Finita
\item Não pode ser ambígua
\end{itemize}
\end{itemize}

\alert{Voltando ao nosso problema:}
\end{frame}

\begin{frame}[label={sec:orgd3f6a7c}]{Algoritmo}
\begin{itemize}
\item Para resolver um problema, primeiro precisamos de uma descrição clara da solução
\item Um algoritmo é uma sequência de instruções (receita)
\begin{itemize}
\item Finita
\item Não pode ser ambígua
\end{itemize}
\end{itemize}

\alert{Voltando ao nosso problema:}

\begin{itemize}
\item Sejam A e B os valores dados
\item Atribuir o valor 0 ao quociente (q)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgfd3591f}]{Algoritmo}
\begin{itemize}
\item Para resolver um problema, primeiro precisamos de uma descrição clara da solução
\item Um algoritmo é uma sequência de instruções (receita)
\begin{itemize}
\item Finita
\item Não pode ser ambígua
\end{itemize}
\end{itemize}

\alert{Voltando ao nosso problema:}

\begin{itemize}
\item Sejam A e B os valores dados
\item Atribuir o valor 0 ao quociente (q)
\item Enquanto \alert{B <= A}:
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org2588b00}]{Algoritmo}
\begin{itemize}
\item Para resolver um problema, primeiro precisamos de uma descrição clara da solução
\item Um algoritmo é uma sequência de instruções (receita)
\begin{itemize}
\item Finita
\item Não pode ser ambígua
\end{itemize}
\end{itemize}

\alert{Voltando ao nosso problema:}

\begin{itemize}
\item Sejam A e B os valores dados
\item Atribuir o valor 0 ao quociente (q)
\item Enquanto \alert{B <= A}:
\begin{itemize}
\item Somar 1 ao valor de q
\item Subtrair B do valor de A
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org7c29e46}]{Algoritmo}
\begin{itemize}
\item Para resolver um problema, primeiro precisamos de uma descrição clara da solução
\item Um algoritmo é uma sequência de instruções (receita)
\begin{itemize}
\item Finita
\item Não pode ser ambígua
\end{itemize}
\end{itemize}

\alert{Voltando ao nosso problema:}

\begin{itemize}
\item Sejam A e B os valores dados
\item Atribuir o valor 0 ao quociente (q)
\item Enquanto \alert{B <= A}:
\begin{itemize}
\item Somar 1 ao valor de q
\item Subtrair B do valor de A
\end{itemize}
\item Atribuir o valor final de A ao resto (r)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgde8c408},fragile]{Implementando o algoritmo}
 \vspace{-2em}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    // TODO
}
\end{minted}
\end{frame}

\begin{frame}[label={sec:orgd064266},fragile]{Implementando o algoritmo}
 \vspace{-2em}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int a = 7;
    int b = 3;
    int q = 0; // Inicializando quociente
    while (b <= a) {
        q = q + 1; // Somar 1 ao valor de q
        a = a - b; // Subtrair B do valor de A
    }
    int r = a; // resto = valor final de A
    printf("Quociente: %d\n", q);
    printf("Resto:  %d\n", r);
    return 0;
}
\end{minted}
\end{frame}

\begin{frame}[label={sec:org371f671}]{Algoritmo vs Implementação}
\begin{itemize}
\item Note que o algoritmo (pseudo-código) que escrevemos anteriormente é mais alto nível, sem muitas regras
\item A implementação em alguma linguagem (nosso caso = C), por outro lado, obedece \alert{regras de sintaxe}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org9c5acaf}]{Erro de Sintaxe}
\begin{itemize}
\item Em C, todo comando deve ser terminado por ponto e vírgula
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgae40247},fragile]{Erro de Sintaxe}
 \begin{itemize}
\item Em C, todo comando deve ser terminado por ponto e vírgula
\end{itemize}

\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
int main(int argc, char *argv[]) {
    int a = 7;
    return 0 // expected ';' before '}' token
}
\end{minted}
\end{frame}

\begin{frame}[label={sec:org08ed685},fragile]{Erro de Lógica}
 \begin{itemize}
\item \alert{Atenção!} Não basta obter um programa executável!! Será que ele está correto?
\item Considere o seguinte problema: determinar e exibir o valor de \texttt{y = seno(1,5)}
\end{itemize}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
#include <math.h>

int main(int argc, char *argv[]) {
    // TODO
    return 0;
}
\end{minted}
\end{frame}

\begin{frame}[label={sec:org936c1c8},fragile]{Erro de Lógica}
 \begin{itemize}
\item \alert{Atenção!} Não basta obter um programa executável!! Será que ele está correto?
\item Considere o seguinte problema: determinar e exibir o valor de \texttt{y = seno(1,5)}
\end{itemize}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
#include <math.h>

int main(int argc, char *argv[]) {
    float y = sin(1.5);
    printf("seno de 1,5 = %f\n", y);
    return 0;
}
\end{minted}
\end{frame}

\begin{frame}[label={sec:orgae5c99f},fragile]{Erro de Lógica}
 \begin{itemize}
\item Se ao invés de \texttt{y = sin(1.5);} tivéssemos escrito \texttt{y = sin(2.5)}, o programa seria produzido e executaria normalmente
\end{itemize}
\begin{minted}[,frame=lines,framesep=2mm,linenos]{c}
#include <stdio.h>
#include <math.h>

int main(int argc, char *argv[]) {
    float y = sin(2.5);
    printf("seno de 1,5 = %f\n", y);
    return 0;
}
\end{minted}
\end{frame}

\begin{frame}[label={sec:org7abfdd5},fragile]{Erro de Lógica}
 \begin{itemize}
\item Se ao invés de \texttt{y = sin(1.5);} tivéssemos escrito \texttt{y = sin(2.5)}, o programa seria produzido e executaria normalmente
\item Embora um resultado tenha sido obtido, ele \alert{não é correto}
\item Se um programa executável não produz os resultados corretos, é porque ele contém \alert{erros de lógica} ou \alert{bugs}
\item O processo de identificação e correção de erros de lógica é denominado \alert{depuração} (\alert{debug}).
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgc63d011}]{Como o computador entende o que escrevemos?}
\begin{itemize}
\item Nosso programa em C é um texto
\item O computador entende textos?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org0b4d8a9}]{Como o computador entende o que escrevemos?}
\begin{itemize}
\item Nosso programa em C é um texto
\item O computador entende textos?
\item \alert{Não!} Computadores executam instruções escritas em formato binário (0's e 1's)
\item Precisamos traduzir nosso texto para \alert{linguagem de máquina}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgcaf9516}]{Como o computador entende o que escrevemos?}
\begin{itemize}
\item Nosso programa em C é um texto
\item O computador entende textos?
\item \alert{Não!} Computadores executam instruções escritas em formato binário (0's e 1's)
\item Precisamos traduzir nosso texto para \alert{linguagem de máquina}
\end{itemize}

\centering\vspace{0.5em}\tikzset{every picture/.style={line width=0.75pt}} %set default line width to 0.75pt
\begin{tikzpicture}[x=0.75pt,y=0.75pt,yscale=-1,xscale=1]
%uncomment if require: \path (0,170); %set diagram left start at 0, and has height of 170

%Shape: Rectangle [id:dp7852098459874652]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (99,50) -- (170.5,50) -- (170.5,110) -- (99,110) -- cycle ;
%Shape: Rectangle [id:dp240405123901279]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (320.5,49.5) -- (392,49.5) -- (392,109.5) -- (320.5,109.5) -- cycle ;
%Shape: Free Drawing [id:dp02650560539042357]
\draw  [color={rgb, 255:red, 178; green, 53; blue, 37 }  ,draw opacity=1 ][line width=3] [line join = round][line cap = round] (239,66) .. controls (236.9,55.48) and (251.28,52.56) .. (254.5,59) .. controls (258.98,67.97) and (247.87,69.94) .. (244.5,76) .. controls (242.78,79.1) and (242.41,89) .. (248.5,89) ;
%Shape: Free Drawing [id:dp11935749666588036]
\draw  [color={rgb, 255:red, 178; green, 53; blue, 37 }  ,draw opacity=1 ][line width=3] [line join = round][line cap = round] (247,100) .. controls (247,96.96) and (244.7,104.8) .. (248,101.5) .. controls (248.72,100.78) and (248.67,99.5) .. (248.5,98.5) .. controls (248.34,97.56) and (246.71,100) .. (246.5,100) ;

% Text Node
\draw (102,61) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{44.91pt}\setlength\topsep{0pt}
\begin{center}
Código \\(texto)
\end{center}

\end{minipage}};
% Text Node
\draw (330,61) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{36.76pt}\setlength\topsep{0pt}
\begin{center}
1011\\0010
\end{center}

\end{minipage}};

\end{tikzpicture}
\end{frame}
