teaching/pds1/slides/01-introducao.tex

\begin{frame}[label={sec:org2040c03}]{Como o computador entende o que escrevemos?}
\begin{itemize}
\item Nosso programa em C é um texto
\item O computador entende textos?
\item \alert{Não!} Computadores executam instruções escritas em formato binário (0's e 1's)
\item Precisamos traduzir nosso texto para \alert{linguagem de máquina}
\end{itemize}

\centering\vspace{0.5em}\tikzset{every picture/.style={line width=0.75pt}} %set default line width to 0.75pt
\begin{tikzpicture}[x=0.75pt,y=0.75pt,yscale=-1,xscale=1]
%uncomment if require: \path (0,170); %set diagram left start at 0, and has height of 170

%Shape: Rectangle [id:dp7852098459874652]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (99,50) -- (170.5,50) -- (170.5,110) -- (99,110) -- cycle ;
%Shape: Rectangle [id:dp240405123901279]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (320.5,49.5) -- (392,49.5) -- (392,109.5) -- (320.5,109.5) -- cycle ;
%Right Arrow [id:dp6605035354622533]
\draw  [fill={rgb, 255:red, 178; green, 53; blue, 37 }  ,fill opacity=1 ] (190,71.25) -- (257.5,71.25) -- (257.5,60.5) -- (302.5,82) -- (257.5,103.5) -- (257.5,92.75) -- (190,92.75) -- cycle ;

% Text Node
\draw (102,61) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{44.91pt}\setlength\topsep{0pt}
\begin{center}
Código \\(texto)
\end{center}

\end{minipage}};
% Text Node
\draw (330,61) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{36.76pt}\setlength\topsep{0pt}
\begin{center}
1011\\0010
\end{center}

\end{minipage}};
% Text Node
\draw (192.5,74) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 255; green, 255; blue, 255 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{65.31pt}\setlength\topsep{0pt}
\begin{center}
Compilador
\end{center}

\end{minipage}};

\end{tikzpicture}
\end{frame}

\begin{frame}[label={sec:orgc0fda21},fragile]{Como o computador entende o que escrevemos?}
 \begin{itemize}
\item Nosso programa em C é um texto
\item O computador entende textos?
\item \alert{Não!} Computadores executam instruções escritas em formato binário (0's e 1's)
\item Precisamos traduzir nosso texto para \alert{linguagem de máquina}
\end{itemize}

\centering\vspace{0.5em}\tikzset{every picture/.style={line width=0.75pt}} %set default line width to 0.75pt
\begin{tikzpicture}[x=0.75pt,y=0.75pt,yscale=-1,xscale=1]
%uncomment if require: \path (0,170); %set diagram left start at 0, and has height of 170

%Shape: Rectangle [id:dp7852098459874652]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (99,50) -- (170.5,50) -- (170.5,110) -- (99,110) -- cycle ;
%Shape: Rectangle [id:dp240405123901279]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (320.5,49.5) -- (392,49.5) -- (392,109.5) -- (320.5,109.5) -- cycle ;
%Right Arrow [id:dp6605035354622533]
\draw  [fill={rgb, 255:red, 178; green, 53; blue, 37 }  ,fill opacity=1 ] (190,71.25) -- (257.5,71.25) -- (257.5,60.5) -- (302.5,82) -- (257.5,103.5) -- (257.5,92.75) -- (190,92.75) -- cycle ;

% Text Node
\draw (102,61) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{44.91pt}\setlength\topsep{0pt}
\begin{center}
Código \\(texto)
\end{center}

\end{minipage}};
% Text Node
\draw (330,61) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{36.76pt}\setlength\topsep{0pt}
\begin{center}
1011\\0010
\end{center}

\end{minipage}};
% Text Node
\draw (192.5,74) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 255; green, 255; blue, 255 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{65.31pt}\setlength\topsep{0pt}
\begin{center}
Compilador
\end{center}

\end{minipage}};

\end{tikzpicture}

\begin{itemize}
\item O processo de ``tradução'' do código é chamado de \alert{compilação}
\item O \alert{compilador} recebe o \alert{código fonte} e produz um \alert{programa executável}
\item \texttt{gcc main.c -o main}
\end{itemize}
\end{frame}
