teaching/pds1/slides/01-introducao.tex

\begin{frame}[label={sec:org2f340b9}]{Compilação}
\begin{itemize}
\item É um pouquinho mais complexo que isso
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgd3aa6c4}]{Compilação}
\begin{itemize}
\item É um pouquinho mais complexo que isso
\end{itemize}

\centering\vspace{0.5em}\tikzset{every picture/.style={line width=0.75pt}} %set default line width to 0.75pt
\begin{tikzpicture}[x=0.75pt,y=0.75pt,yscale=-1,xscale=1]
%uncomment if require: \path (0,270); %set diagram left start at 0, and has height of 270

%Shape: Rectangle [id:dp7852098459874652]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (11,50) -- (82.5,50) -- (82.5,110) -- (11,110) -- cycle ;
%Shape: Rectangle [id:dp240405123901279]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (260.5,49.5) -- (349.5,49.5) -- (349.5,109.5) -- (260.5,109.5) -- cycle ;
%Straight Lines [id:da08666006294713702]
\draw    (90,79.98) -- (112.5,80.46) ;
\draw [shift={(114.5,80.5)}, rotate = 181.21] [color={rgb, 255:red, 0; green, 0; blue, 0 }  ][line width=0.75]    (10.93,-3.29) .. controls (6.95,-1.4) and (3.31,-0.3) .. (0,0) .. controls (3.31,0.3) and (6.95,1.4) .. (10.93,3.29)   ;
%Shape: Rectangle [id:dp38842710070627606]
\draw  [fill={rgb, 255:red, 178; green, 53; blue, 37 }  ,fill opacity=1 ] (120.5,50) -- (219,50) -- (219,110) -- (120.5,110) -- cycle ;
%Straight Lines [id:da5494063713073924]
\draw    (228,79.98) -- (250.5,80.46) ;
\draw [shift={(252.5,80.5)}, rotate = 181.21] [color={rgb, 255:red, 0; green, 0; blue, 0 }  ][line width=0.75]    (10.93,-3.29) .. controls (6.95,-1.4) and (3.31,-0.3) .. (0,0) .. controls (3.31,0.3) and (6.95,1.4) .. (10.93,3.29)   ;
%Shape: Rectangle [id:dp10236773740516991]
\draw  [fill={rgb, 255:red, 178; green, 53; blue, 37 }  ,fill opacity=1 ] (261,155) -- (350,155) -- (350,215) -- (261,215) -- cycle ;
%Straight Lines [id:da28904142100608676]
\draw    (305,120) -- (305,140) ;
\draw [shift={(305,144)}, rotate = 270] [color={rgb, 255:red, 0; green, 0; blue, 0 }  ][line width=0.75]    (10.93,-3.29) .. controls (6.95,-1.4) and (3.31,-0.3) .. (0,0) .. controls (3.31,0.3) and (6.95,1.4) .. (10.93,3.29)   ;
%Shape: Rectangle [id:dp312816305480381]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (120.5,149.5) -- (220.5,149.5) -- (220.5,231) -- (120.5,231) -- cycle ;
%Straight Lines [id:da17984903366089666]
\draw    (228,190) -- (250.5,190) ;
\draw [shift={(252.5,190)}, rotate = 181.21] [color={rgb, 255:red, 0; green, 0; blue, 0 }  ][line width=0.75]    (10.93,-3.29) .. controls (6.95,-1.4) and (3.31,-0.3) .. (0,0) .. controls (3.31,0.3) and (6.95,1.4) .. (10.93,3.29)   ;
%Shape: Rectangle [id:dp9233001220236068]
\draw  [fill={rgb, 255:red, 255; green, 255; blue, 255 }  ,fill opacity=1 ] (391,155) -- (480,155) -- (480,215) -- (391,215) -- cycle ;
%Straight Lines [id:da8370387235079737]
\draw    (356.5,190) -- (379,190) ;
\draw [shift={(381,190)}, rotate = 181.21] [color={rgb, 255:red, 0; green, 0; blue, 0 }  ][line width=0.75]    (10.93,-3.29) .. controls (6.95,-1.4) and (3.31,-0.3) .. (0,0) .. controls (3.31,0.3) and (6.95,1.4) .. (10.93,3.29)   ;

% Text Node
\draw (13.5,61) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{44.91pt}\setlength\topsep{0pt}
\begin{center}
Código \\Fonte
\end{center}

\end{minipage}};
% Text Node
\draw (265.5,61) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{56.46pt}\setlength\topsep{0pt}
\begin{center}
Programa\\Objeto
\end{center}

\end{minipage}};
% Text Node
\draw (122.5,68) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 255; green, 255; blue, 255 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{65.31pt}\setlength\topsep{0pt}
\begin{center}
Compilador
\end{center}

\end{minipage}};
% Text Node
\draw (275,176) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 255; green, 255; blue, 255 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{43.55pt}\setlength\topsep{0pt}
\begin{center}
Ligador
\end{center}

\end{minipage}};
% Text Node
\draw (123.5,163) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{65.32pt}\setlength\topsep{0pt}
\begin{center}
Programa\\Objeto das \\Bibliotecas
\end{center}

\end{minipage}};
% Text Node
\draw (397,170) node [anchor=north west][inner sep=0.75pt]  [font=\large,color={rgb, 255:red, 0; green, 0; blue, 0 }  ,opacity=1 ] [align=left] {\begin{minipage}[lt]{56.46pt}\setlength\topsep{0pt}
\begin{center}
Programa\\Exec
\end{center}

\end{minipage}};

\end{tikzpicture}
\end{frame}


\begin{frame}[label={sec:org8c5d6ab}]{Ambiente de Programação}
\begin{itemize}
\item O que vamos precisar?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgca178e2},fragile]{Ambiente de Programação}
 \begin{itemize}
\item O que vamos precisar?

\item Compilador de C: \texttt{gcc}
\begin{itemize}
\item Linux: já vem instalado
\item Windows: MinGW (tutorial de instalação no Moodle)
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgd3a9a29},fragile]{Ambiente de Programação}
 \begin{itemize}
\item O que vamos precisar?

\item Compilador de C: \texttt{gcc}
\begin{itemize}
\item Linux: já vem instalado
\item Windows: MinGW (tutorial de instalação no Moodle)
\end{itemize}

\item Editor de texto
\begin{itemize}
\item Bloco de notas
\item Notepad++: \url{https://notepad-plus-plus.org}
\item Visual Studio Code (VS code): \url{https://code.visualstudio.com/}
\item Atom: \url{https://atom.io}
\item Sublime: \url{https://www.sublimetext.com/}
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org1109d99},fragile]{Ambiente de Programação}
 \begin{itemize}
\item O que vamos precisar?

\item Compilador de C: \texttt{gcc}
\begin{itemize}
\item Linux: já vem instalado
\item Windows: MinGW (tutorial de instalação no Moodle)
\end{itemize}

\item Editor de texto
\begin{itemize}
\item Bloco de notas
\item Notepad++: \url{https://notepad-plus-plus.org}
\item Visual Studio Code (VS code): \url{https://code.visualstudio.com/}
\item Atom: \url{https://atom.io}
\item Sublime: \url{https://www.sublimetext.com/}
\end{itemize}

\item Ambiente integrado: Code::Blocks (tutorial no Moodle)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org7c2c6d5},fragile]{Ambiente de Programação}
 \begin{itemize}
\item O que vamos precisar?

\item Compilador de C: \texttt{gcc}
\begin{itemize}
\item Linux: já vem instalado
\item Windows: MinGW (tutorial de instalação no Moodle)
\end{itemize}

\item Editor de texto
\begin{itemize}
\item Bloco de notas
\item Notepad++: \url{https://notepad-plus-plus.org}
\item Visual Studio Code (VS code): \url{https://code.visualstudio.com/}
\item Atom: \url{https://atom.io}
\item Sublime: \url{https://www.sublimetext.com/}
\end{itemize}

\item Ambiente integrado: Code::Blocks (tutorial no Moodle)
\item Ambiente online: \url{https://repl.it}
\end{itemize}
\end{frame}
\end{document}
